# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

print("enter number")
n = int(input())
print(bin(n))
